In [38]:

import pandas as pd
import matplotlib as plt
import sqlalchemy
import psycopg2

%matplotlib inline
from sqlalchemy import create_engine
from postgres_password import pass_word

ImportError: cannot import name 'pass_word' from 'postgres_password' (c:\Users\haifa\Documents\bootcamp\git lab folders\bootcamp_folder\assignments\SQL_employee_database\Employee_SQL\postgres_password.py)

In [28]:

engine = create_engine(f'postgresql://postgres:{pass_word}@localhost:5432/employees_db')

connection = engine.connect()

In [29]:
employee_df=pd.read_sql_query('''SELECT * FROM employees;''', connection)
employee_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [30]:
salary_df = pd.read_sql_query('''SELECT * FROM salaries''',connection)
salary_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228